app/views/configurations/add_permissions_user.html.haml


  $("#user_id").change(function() {
    var user_id = $(this).find("option:selected").val();
    if(user_id){}else{
      clearCheckBox();
      return;
    }
    $.get("/users/get_permission_selected",{user_id: user_id}).done(function(data){
      clearCheckBox();
      if(data){
        datos = data.split(",");
        for (var i = 0; i < "#{@count}"; i++) {
          var checkBox = document.getElementById(i.toString());
          if(datos.indexOf(checkBox.getAttribute("permission_id-data")) >= 0){
            checkBox.checked = true;
          }else{
            checkBox.checked = false;
          }
        }
      }
      $.uniform.update();
    });
---
UPDATE `users` SET `last_request_at` = '2014-04-10 19:51:53', `perishable_token` = 'tibpBVeb0Goq2pRHmKn' WHERE `users`.`id` = 1