app/views/configurations/associate_assistant_doctor.html.haml

UPDATE `users` SET `last_request_at` = '2014-04-11 19:24:53', `perishable_token` = '9bJsxoaxgyupmWVQfIJ' WHERE `users`.`id` = 1
---

  $("#user_id").change(function() {
    var user_id = $(this).find("option:selected").val();
    if(user_id){}else{
      clearCheckBox();
      return;
    }
    $.get("/users/get_assosiate_assitant",{user_id: user_id}).done(function(data){
      clearCheckBox();
      if(data){
        datos = data.split(",");
        for (var i = 0; i < "#{@count}"; i++) {
          var checkBox = document.getElementById(i.toString());
          if(datos.indexOf(checkBox.getAttribute("medic_id-data")) >= 0){
            checkBox.checked = true;
          }else{
            checkBox.checked = false;
          }
        }
      }
      $.uniform.update();
    });