app/views/insurances/_partial_form.html.haml

SELECT `organizations`.* FROM `organizations`
---
          =f.label :organization_id
          =f.collection_select :organization_id, Organization.all.sort_by(&:name), :id, :name, {:include_blank => ''}
        .clearfix