app/views/partials/_datagrid.html.haml

            -when :product_id
              =object.products.nullo.first.name.if_nil("-")
---
SELECT `products`.* FROM `products`