app/views/partials/_partial_show_addresses.html.haml

  %tbody
    - object.addresses.each do |address|
---
SELECT `addresses`.* FROM `addresses` WHERE (`addresses`.organization_id = 3)