app/views/rate_services/_partial_form.html.haml

SELECT `organizations`.* FROM `organizations`
---
          =f.label :organization_id
          =f.collection_select :organization_id, Organization.all.sort_by(&:name), :id, :name, {:include_blank => ''}
        .clearfix

UPDATE `users` SET `last_request_at` = '2014-04-17 20:43:49', `perishable_token` = '05Yl630pxBX4cSd6cQE' WHERE `users`.`id` = 4
---
:javascript
  $(document).ready(function(){
    $("#rate_service_organization_id").change(function() {
        var organizationId = $(this).find("option:selected").val();
        if(organizationId){
          $("#rate_service_user_id").hide();
          getServices(organizationId,'organization_id');
        }else{
          $("#rate_service_user_id").show();
          document.getElementById("rate_service_service_id").innerHTML = "";
        }
        $.uniform.update();
    });
    $("#rate_service_user_id").change(function() {
        var userId = $(this).find("option:selected").val();
        if(userId){
          $("#rate_service_organization_id").hide();
          getServices(userId,'user_id');
        }else{
          $("#rate_service_organization_id").show();
          document.getElementById("rate_service_service_id").innerHTML = "";
        }