app/views/documents/show.html.haml

      =@document.document_type
    -if @document.attach.present?
---
SELECT `attaches`.* FROM `attaches` WHERE (`attaches`.object_id = 1) LIMIT 1