app/controllers/attaches_controller.rb

SELECT `attaches`.* FROM `attaches` WHERE `attaches`.`id` = 1 LIMIT 1
---
  def view_files
    attach = Attach.find_by_id params[:id]