app/controllers/cites_controller.rb

  def create
    if params[:send_notification]
      @doctor = User.find_by_id(params[:user_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1