app/controllers/configurations_controller.rb

SELECT `users`.* FROM `users`
SELECT `permissions`.* FROM `permissions`
---
  def add_permissions_user
    @users = User.all
    @permissions = Permission.all

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `roles`.* FROM `roles` WHERE (`roles`.user_id = 1)
INSERT INTO `roles` (`title`, `user_id`, `is_enabled`, `profile_id`) VALUES ('system', 1, NULL, NULL)
---
  def create_permission_user
    user = User.find_by_id params[:user_id]
    permissions = params[:permissions].split(",")
    unless permissions.present?
      redirect_to :back
      return
    end
    roles = Role.for_user_id params[:user_id]
    roles.destroy_all if roles.present?
    permissions.each do |permission|
      user.roles.create(:title => permission)

INSERT INTO `assistant_medics` (`assistant_id`, `medic_id`, `created_at`, `updated_at`) VALUES (2, 5, '2014-04-11 20:02:18', '2014-04-11 20:02:18')
---
  def create_associate
    user = params[:user_id]
    medics = params[:medics].split(",")
    new_assiatan_medic = []
    medics.each do |medic|
      new_assiatan_medic << {:assistant_id=>user,:medic_id=>medic}
    end
    if AssistantMedic.create(new_assiatan_medic)