app/controllers/consults_controller.rb

  def create
    @consult = Consult.new params[:consult]
    unless @consult.save
---
INSERT INTO `consults` (`description`, `user_id`, `patient_id`, `cite_id`, `created_at`, `updated_at`, `sub_total`, `tax`, `total`) VALUES ('adf', 4, 1, 2, '2014-04-17 21:19:02', '2014-04-17 21:19:02', 900.0, 144.0, 1044.0)

  def create_documents
    payment_method = params[:payment_method]
    insurance = params[:insurance]
    consult_id = params[:id]
    if consult_id.present?
      @consult = Consult.find_by_id consult_id
      if @consult.create_document(insurance,{:payment_method=>payment_method})
---
SELECT `consults`.* FROM `consults` WHERE `consults`.`id` IS NULL LIMIT 1
INSERT INTO `documents` (`date`, `format`, `medic_id`, `patient_id`, `payment_method`, `rfc`, `street`, `number`, `address1`, `address2`, `address3`, `address4`, `address5`, `address6`, `city`, `state_id`, `country_id`, `zip_code`, `comments`, `organization_rfc`, `organization_street`, `organization_number`, `organization_address1`, `organization_address2`, `organization_address3`, `organization_address4`, `organization_address5`, `organization_address6`, `organization_zip_code`, `organization_city`, `organization_state_id`, `organization_country_id`, `amount_sub_total`, `amount_tax1`, `amount_tax2`, `amount_tax3`, `amount_total`, `amount_due`, `amount_paid`, `service_id`, `consult_id`, `certified_number`, `stamp`, `original_chain`, `document_type`, `uuid`, `certified_number_sat`, `stamp_sat`, `folio_series`, `folio`, `canceled_date`, `cancelled`, `created_at`, `updated_at`, `insurance_id`) VALUES ('2014-04-18', NULL, 4, 1, '1', 'xxx00000xx', 'fgd', '123', NULL, NULL, NULL, NULL, NULL, NULL, 'sf', 1, 1, NULL, NULL, 'xxx00000xx', 'fgd', '123', NULL, NULL, NULL, NULL, NULL, NULL, NULL, 'sf', 1, 1, 900.0, 144.0, NULL, NULL, 1044.0, 1044.0, 0.0, NULL, 2, NULL, NULL, NULL, 'Insurance', NULL, NULL, NULL, NULL, NULL, NULL, 0, '2014-04-18 22:41:53', '2014-04-18 22:41:53', 1)