app/controllers/documents_controller.rb

  def build_pdf
    document = Document.find_by_id params[:id]
---
SELECT `documents`.* FROM `documents` WHERE `documents`.`id` IS NULL LIMIT 1

  def invoices
    @document = Document.find_by_id params[:id]
---
SELECT `documents`.* FROM `documents` WHERE `documents`.`id` = 1 LIMIT 1