app/controllers/patients_controller.rb

  def get_patient_for_medic
    @patient = Patient.for_user_medic params[:user_id]
    hash={}
    hash[:cite_patient_id] = @patient.map{|p| [p.name,p.id]} if @patient.present?
---
SELECT `patients`.* FROM `patients` WHERE `patients`.`user_id` = 4