app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `addresses`.* FROM `addresses` WHERE (`addresses`.user_id = 4)
---
  def edit
    @user = User.find_by_id params[:id]
    @addresses = @user.addresses
    @person = @user.person
    @addresses = Address.new if @addresses.blank?

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `roles`.* FROM `roles` WHERE (`roles`.user_id = 2)
---
  def get_permission_selected
    @user = User.find_by_id params[:user_id]
    hash=[]
    @user.roles.map{|r| hash << r.title} if @user.roles.present?

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def get_assosiate_assitant
    @user = User.find_by_id params[:user_id]