app/controllers/webservices_controller.rb

  def check_time_limit
    time_limits = TimeLimit.get_enabled_user_date(params[:organization_id],params[:date].to_date)
    hash={}
    hash[:details]={}
    if hash[:status] = time_limits.present?
---
SELECT `time_limits`.* FROM `time_limits` WHERE (user_id = '1' and start_date < '2014-04-09' and end_date > '2014-04-09') LIMIT 1